Revit 2024 API
RevisionVisibility Enumeration
 Determines whether Revision Clouds and Revision Tags will be visible in the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Since: 2015
Syntax
C#
public enum RevisionVisibility
Visual Basic
Public Enumeration RevisionVisibility
Visual C++
public enum class RevisionVisibility
Members
Member name | Description
Hidden |  Revision Clouds and Revision Tags will not be visible in the project.
CloudAndTagVisible |  Revision Clouds and Revision Tags will be visible in the project.
TagVisible |  Revision Tags will be visible in the project but Revision Clouds will not be.
See Also
Autodesk.Revit.DB Namespace